#                                       WEB-SCRAPING-ASSIGNMENT-2

In [1]:
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [2]:
def verify_url(url):
    page = requests.get(url)
    print(page)
    return BeautifulSoup(page.content, 'html.parser')

# Question 1. Write a python program to display all the header tags from‘en.wikipedia.org/wiki/Main_Page’.

In [3]:
url="https://en.wikipedia.org/wiki/Main_Page"

In [4]:
soup = verify_url(url)

<Response [200]>

In [5]:
header = soup.find_all("span", class_="mw-headline")
header

[<span class="mw-headline" id="From_today's_featured_article">From today's featured article</span>,
 <span class="mw-headline" id="Did_you_know_...">Did you know ...</span>,
 <span class="mw-headline" id="In_the_news">In the news</span>,
 <span class="mw-headline" id="On_this_day">On this day</span>,
 <span class="mw-headline" id="From_today's_featured_list">From today's featured list</span>,
 <span class="mw-headline" id="Today's_featured_picture">Today's featured picture</span>,
 <span class="mw-headline" id="Other_areas_of_Wikipedia">Other areas of Wikipedia</span>,
 <span class="mw-headline" id="Wikipedia's_sister_projects">Wikipedia's sister projects</span>,
 <span class="mw-headline" id="Wikipedia_languages">Wikipedia languages</span>]

In [6]:
Header = []

for i in header:
    Header.append(i.text)

Header_Tags=pd.DataFrame()
Header_Tags['Header']=Header

Header_Tags

                          Header
0  From today's featured article
1               Did you know ...
2                    In the news
3                    On this day
4     From today's featured list
5       Today's featured picture
6       Other areas of Wikipedia
7    Wikipedia's sister projects
8            Wikipedia languages

# Question 2. Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release).

In [7]:
url = "https://www.imdb.com/chart/top/"

In [8]:
soup = verify_url(url)

<Response [200]>

In [84]:
movie = soup.find_all("td", class_="titleColumn")

In [85]:
Movie =[] #  empty List

for i in movie:
    for j in i.find_all("a"):
        Movie.append(j.text.replace("\n",""))

In [11]:
len(Movie)

250

In [86]:
rate = soup.find_all("td", class_="ratingColumn imdbRating")

In [87]:
Rate =[] #  empty List

for i in rate:
    Rate.append(i.text.replace("\n", ""))

In [14]:
len(Rate)

250

In [88]:
year = soup.find_all("span",class_="secondaryInfo")

In [89]:
Year = []
for i in year:
     Year.append(i.text.replace("(","").replace(")",""))

In [17]:
top100_movies=pd.DataFrame({})
top100_movies['Movie Name']=Movie [:100]
top100_movies['IMDB Rating']=Rate [:100]
top100_movies['Year of Release']=Year [:100]

top100_movies

                               Movie Name IMDB Rating Year of Release
0                The Shawshank Redemption         9.2            1994
1                           The Godfather         9.1            1972
2                  The Godfather: Part II         9.0            1974
3                         The Dark Knight         9.0            2008
4                            12 Angry Men         8.9            1957
..                                    ...         ...             ...
95                                 Jagten         8.3            2012
96                    Requiem for a Dream         8.3            2000
97                    Singin' in the Rain         8.3            1952
98                     North by Northwest         8.3            1959
99  Eternal Sunshine of the Spotless Mind         8.3            2004

[100 rows x 3 columns]

# Questions 3 : Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release).

In [18]:
url = "https://www.imdb.com/india/top-rated-indian-movies/"

In [19]:
soup = verify_url(url)

<Response [200]>

In [90]:
Bollywood_movie = soup.find_all("td", class_="titleColumn")

In [91]:

Bollywood_Movie =[] #  empty List

for i in Bollywood_movie:
    for j in i.find_all("a"):
        Bollywood_Movie.append(j.text.replace("\n",""))

In [92]:
rate = soup.find_all("td", class_="ratingColumn imdbRating")

In [23]:
len(Movie)

250

In [93]:
Rate = []
for i in rate:
    Rate.append(i.text.replace("\n", ""))

In [94]:
year = soup.find_all("span",class_="secondaryInfo")

In [26]:
len(rate)

250

In [95]:
Year = []
for i in year:
     Year.append(i.text.replace("(","").replace(")",""))

In [28]:
len(Year)

250

In [29]:
Top100_Bollywood_movies=pd.DataFrame({})
Top100_Bollywood_movies['Bollywood Movies Name']=Movie [:100]
Top100_Bollywood_movies['Bollywood Movies IMDB Rating']=Rate [:100]
Top100_Bollywood_movies['Bollywood Movies Year of Release']=Year [:100]

Top100_Bollywood_movies

,Bollywood Movies Name,Bollywood Movies IMDB Rating,Bollywood Movies Year of Release
0,The Shawshank Redemption,8.5,1987
1,The Godfather,8.5,2003
2,The Godfather: Part II,8.5,2018
3,The Dark Knight,8.5,2018
4,12 Angry Men,8.5,1979
...,...,...,...
95,Jagten,8.1,2006
96,Requiem for a Dream,8.1,1992
97,Singin' in the Rain,8.1,2001
98,North by Northwest,8.1,2019
99,Eternal Sunshine of the Spotless Mind,8.1,1994

# Questions 4: Write a python program to scrap book name, author name, genre and book review of any 5 books from ‘www.bookpage.com’

In [30]:
url = "https://bookpage.com/reviews"

In [31]:
soup = verify_url(url)

<Response [200]>

In [96]:
name = soup.find_all("h4", class_="italic")

In [97]:
Name =[] #  empty List

for i in name:
     Name.append(i.text.replace("\n",""))

In [98]:
author = soup.find_all("p",class_="sans bold")

In [99]:
Author =[]

for i in author:
     Author.append(i.text.replace("\n",""))

In [100]:
genre = soup.find_all("p", class_="genre-links hidden-phone")

In [101]:
Genre =[]

for i in genre:
     Genre.append(i.text.replace("\n",""))

In [102]:
review = soup.find_all("div", class_="read-full")

In [103]:
Review =[]

for i in review:
     Review.append(i.text.replace("\n",""))

# Questions -5: Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

i) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [40]:
url="https://www.icc-cricket.com/rankings/mens/team-rankings/odi"

In [41]:
soup = verify_url(url)

<Response [200]>

In [42]:
team_name = soup.find_all("span", class_="u-hide-phablet")
match1 = soup.find_all("td", class_="rankings-block__banner--matches")
point1 = soup.find_all("td", class_="rankings-block__banner--points")
match2 = soup.find_all("td", class_="table-body__cell u-center-text")
rating1 = soup.find_all("td", class_="rankings-block__banner--rating u-text-right")
rating2 = soup.find_all("td", class_="table-body__cell u-text-right rating")
rating = rating1+rating2
match = match1 + point1 + match2

In [43]:
Team_Name = []

for i in team_name:
     Team_Name.append(i.text.replace("\n",""))
    
Team_Name = pd.DataFrame(Team_Name)
Team_Name = Team_Name.drop([20,21,22,23,24])
Team_Name.rename({0:'Team_Name'}, axis=1, inplace = True)
Team_Name

           Team_Name
0        New Zealand
1            England
2          Australia
3              India
4       South Africa
5           Pakistan
6         Bangladesh
7        West Indies
8          Sri Lanka
9        Afghanistan
10       Netherlands
11           Ireland
12          Zimbabwe
13          Scotland
14              Oman
15             Nepal
16               UAE
17           Namibia
18     United States
19  Papua New Guinea

In [44]:
Match3 = []

for i in match:
     Match3.append(i.text.replace("\n",""))
    
Match = Match3[0::2]
Match = pd.DataFrame(Match)
Match.rename({0:'Matches'}, axis=1, inplace = True)
Match

   Matches
0       17
1       32
2       28
3       32
4       22
5       27
6       29
7       30
8       29
9       17
10       7
11      23
12      17
13       7
14       7
15       5
16       9
17       6
18       8
19       5

In [45]:
Point = Match3
Point = Point[1::2]
Point = pd.DataFrame(Point)
Point.rename({0:'Points'}, axis=1, inplace = True)
Point

   Points
0   2,054
1   3,793
2   3,244
3   3,624
4   2,267
5   2,524
6   2,639
7   2,523
8   2,303
9   1,054
10    336
11  1,067
12    646
13    258
14    240
15    119
16    190
17     97
18     93
19      0

In [46]:
Rating = []

for i in rating:
    Rating.append(i.text.replace("\n"," ").strip())

Rating = pd.DataFrame(Rating)
Rating.rename({0:'Rating'}, axis=1, inplace = True)
Rating

   Rating
0     121
1     119
2     116
3     113
4     103
5      93
6      91
7      84
8      79
9      62
10     48
11     46
12     38
13     37
14     34
15     24
16     21
17     16
18     12
19      0

In [47]:
print(len(Team_Name))
print(len(Match))
print(len(Point))
print(len(Rating))

20
20
20
20

In [48]:
Top10_ICC_ODI_Team = pd.concat([Team_Name, Match, Point, Rating], axis = 1, sort= False)
Top10_ICC_ODI_Team

           Team_Name Matches Points Rating
0        New Zealand      17  2,054    121
1            England      32  3,793    119
2          Australia      28  3,244    116
3              India      32  3,624    113
4       South Africa      22  2,267    103
5           Pakistan      27  2,524     93
6         Bangladesh      29  2,639     91
7        West Indies      30  2,523     84
8          Sri Lanka      29  2,303     79
9        Afghanistan      17  1,054     62
10       Netherlands       7    336     48
11           Ireland      23  1,067     46
12          Zimbabwe      17    646     38
13          Scotland       7    258     37
14              Oman       7    240     34
15             Nepal       5    119     24
16               UAE       9    190     21
17           Namibia       6     97     16
18     United States       8     93     12
19  Papua New Guinea       5      0      0

ii) Top 10 ODI Batsmen in men along with the records of their team and rating

In [49]:
url = "https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting"

In [50]:
soup = verify_url(url)

<Response [200]>

In [51]:
batsman_player1 = soup.find_all("div", class_="rankings-block__banner--name-large")
team1 = soup.find_all("div", class_="rankings-block__banner--nationality")
rating1 = soup.find_all("div", class_="rankings-block__banner--rating")

In [52]:
batsman_player2 = soup.find_all("td", class_="table-body__cell rankings-table__name name")
team2 = soup.find_all("span", class_="table-body__logo-text")
rating2 = soup.find_all("td", class_="table-body__cell rating")

batsman_player = batsman_player1 + batsman_player2
team = team1 + team2
rating = rating1+rating2

In [104]:
Batsman_Player = []

for i in batsman_player:
    Batsman_Player.append(i.text.replace("\n"," ").strip())

In [105]:
Team = []

for i in team:
    Team.append(i.text.replace("\n"," ").strip())

In [106]:
Rating = []

for i in rating:
    Rating.append(i.text.replace("\n"," ").strip())

In [56]:
Top10_ICC_ODI_Batsmen=pd.DataFrame({})
Top10_ICC_ODI_Batsmen['ODI Batsman Name']=Batsman_Player [:10]
Top10_ICC_ODI_Batsmen['Team']=Team [:10]
Top10_ICC_ODI_Batsmen['Rating']=Rating [:10]

Top10_ICC_ODI_Batsmen

  ODI Batsman Name Team Rating
0       Babar Azam  PAK    873
1      Virat Kohli  IND    844
2     Rohit Sharma  IND    813
3      Ross Taylor   NZ    801
4      Aaron Finch  AUS    779
5   Jonny Bairstow  ENG    775
6     David Warner  AUS    762
7  Quinton de Kock   SA    758
8        Shai Hope   WI    758
9  Kane Williamson   NZ    754

iii) Top 10 ODI bowlers along with the records of their team andrating.

In [57]:
url = "https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling"

In [58]:
soup = verify_url(url)

<Response [200]>

In [59]:
bowler1 = soup.find_all("div", class_="rankings-block__banner--name-large")
team1 = soup.find_all("div", class_="rankings-block__banner--nationality")
rating1 = soup.find_all("div", class_="rankings-block__banner--rating")

In [60]:
bowler2 = soup.find_all("td", class_="table-body__cell rankings-table__name name")
team2 = soup.find_all("span", class_="table-body__logo-text")
rating2 = soup.find_all("td", class_="table-body__cell rating")

bowler = bowler1 + bowler2
team = team1 + team2
rating = rating1+rating2

In [107]:
Bowler = []

for i in bowler:
    Bowler.append(i.text.replace("\n"," ").strip())

In [108]:
Team = []

for i in team:
    Team.append(i.text.replace("\n"," ").strip())

In [109]:
Rating = []

for i in rating:
    Rating.append(i.text.replace("\n"," ").strip())

In [64]:
Top10_ICC_ODI_Bowler=pd.DataFrame({})
Top10_ICC_ODI_Bowler['ODI Bowler Name']=Bowler [:10]
Top10_ICC_ODI_Bowler['Team']=Team [:10]
Top10_ICC_ODI_Bowler['Rating']=Rating [:10]

Top10_ICC_ODI_Bowler

    ODI Bowler Name Team Rating
0       Trent Boult   NZ    737
1    Josh Hazlewood  AUS    709
2  Mujeeb Ur Rahman  AFG    708
3      Chris Woakes  ENG    700
4      Mehedi Hasan  BAN    692
5        Matt Henry   NZ    691
6    Jasprit Bumrah  IND    679
7    Mitchell Starc  AUS    652
8   Shakib Al Hasan  BAN    650
9     Kagiso Rabada   SA    648

# 6. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

i) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [65]:
url="https://www.icc-cricket.com/rankings/womens/team-rankings/odi"

In [66]:
soup = verify_url(url)

<Response [200]>

In [67]:
woman_team = soup.find_all("span", class_="u-hide-phablet")
match1 = soup.find_all("td", class_="rankings-block__banner--matches")
point1 = soup.find_all("td", class_="rankings-block__banner--points")
match2 = soup.find_all("td", class_="table-body__cell u-center-text")
rating1 = soup.find_all("td", class_="rankings-block__banner--rating u-text-right")
rating2 = soup.find_all("td", class_="table-body__cell u-text-right rating")
rating = rating1+rating2
match = match1 + point1 + match2

In [110]:
Woman_Team = []

for i in woman_team:
     Woman_Team.append(i.text.replace("\n",""))
    
Woman_Team = pd.DataFrame(Woman_Team)
Woman_Team = Woman_Team.drop([10,11,12,13,14])
Woman_Team.rename({0:'Woman_Team'}, axis=1, inplace = True)

In [111]:
Match3 = []

for i in match:
     Match3.append(i.text.replace("\n",""))
    
Match = Match3[0::2]
Match = pd.DataFrame(Match)
Match.rename({0:'Matches'}, axis=1, inplace = True)

In [112]:
Point = Match3
Point = Point[1::2]
Point = pd.DataFrame(Point)
Point.rename({0:'Points'}, axis=1, inplace = True)

In [113]:
Rating = []

for i in rating:
    Rating.append(i.text.replace("\n"," ").strip())

Rating = pd.DataFrame(Rating)
Rating.rename({0:'Rating'}, axis=1, inplace = True)

In [72]:
print(len(Woman_Team))
print(len(Match))
print(len(Point))
print(len(Rating))

10
10
10
10

In [114]:
Top10_ICC_ODI_Woman_Team = pd.concat([Woman_Team, Match, Point, Rating], axis = 1, sort= False)
Top10_ICC_ODI_Woman_Team

      Woman_Team Matches Points Rating
0      Australia      18  2,955    418
1        England      20  2,370    418
2   South Africa      24  2,828    394
3          India      23  2,535    365
4    New Zealand      21  1,947    331
5    West Indies      17  1,427    307
6       Pakistan      20  1,496    252
7     Bangladesh       5    306    243
8      Sri Lanka      11    519    242
9        Ireland       2     25    239
10           NaN     NaN    NaN    236
11           NaN     NaN    NaN    215
12           NaN     NaN    NaN    215
13           NaN     NaN    NaN    195
14           NaN     NaN    NaN    181
15           NaN     NaN    NaN    179
16           NaN     NaN    NaN    176
17           NaN     NaN    NaN    164
18           NaN     NaN    NaN    153
19           NaN     NaN    NaN    149

ii) Top 10 women’s ODI players along with the records of their team and rating.

In [74]:
url = "https://www.icc-cricket.com/rankings/womens/player-rankings/odi"

iii) Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [75]:
url = "https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder"

In [76]:
soup = verify_url(url)

<Response [200]>

In [77]:
all_rounder1 = soup.find_all("div", class_="rankings-block__banner--name-large")
team1 = soup.find_all("div", class_="rankings-block__banner--nationality")
rating1 = soup.find_all("div", class_="rankings-block__banner--rating")

In [78]:
all_rounder2 = soup.find_all("td", class_="table-body__cell rankings-table__name name")
team2 = soup.find_all("span", class_="table-body__logo-text")
rating2 = soup.find_all("td", class_="table-body__cell rating")

all_rounder = all_rounder1 + all_rounder2
team = team1 + team2
rating = rating1+rating2

In [79]:
All_Rounder = []

for i in all_rounder:
    All_Rounder.append(i.text.replace("\n"," ").strip())

In [80]:
Team = []

for i in team:
    Team.append(i.text.replace("\n"," ").strip())

In [81]:
Rating = []

for i in rating:
    Rating.append(i.text.replace("\n"," ").strip())

In [82]:
Top10_ICC_Woman_ODI_All_Rounder=pd.DataFrame({})
Top10_ICC_Woman_ODI_All_Rounder['ODI All-Rounder Player']=All_Rounder[:10]
Top10_ICC_Woman_ODI_All_Rounder['Team']=Team [:10]
Top10_ICC_Woman_ODI_All_Rounder['Rating']=Rating[:10]

Top10_ICC_Woman_ODI_All_Rounder

  ODI All-Rounder Player Team Rating
0         Marizanne Kapp   SA    418
1           Ellyse Perry  AUS    418
2        Stafanie Taylor   WI    394
3         Natalie Sciver  ENG    365
4          Deepti Sharma  IND    331
5          Jess Jonassen  AUS    307
6       Ashleigh Gardner  AUS    252
7       Dane van Niekerk   SA    243
8          Sophie Devine   NZ    242
9        Katherine Brunt  ENG    239

# 7. Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [115]:
#url = ""
#soup = verify_url(url)

# 8. Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description

In [ ]:
url = ""
soup = verify_url(url)

# 9. Write a python program to scrape fresher job listings from ‘https://internshala.com/’. It should include job title, company name, CTC, and apply date.

In [ ]:
url = "https://internshala.com/fresher-jobs"
soup = verify_url(url)

In [ ]:
#title = soup.find_all("div", class_="heading_4_5 profile")
#company_name = soup.find_all("div", class_="heading_6 company_name")
ctc = soup.find_all("div", class_="item_body")
ctc

In [ ]:
Title = []

for i in title:
    Title.append(i.text.replace("\n"," ").strip())
    
Title

In [ ]:
Company_Name = []

for i in company_name:
    Company_Name.append(i.text.replace("\n"," ").strip())
    
Company_Name

In [ ]:
CTC = []

for i in ctc:
    CTC.append(i.text.replace("\n"," ").strip())
CTC = CTC[::2]

CTC

# 10. Write a python program to scrape house details from https://www.nobroker.in/ for any location. It should include house title, location, area, emi and price